/**
 * 
 * Разработайте многоступенчатую форму, в которой пользователи могут шаг за шагом заполнять различные секции данных, перемещаться между шагами и сохранять данные на каждом этапе. Тема – «Регистрация пользователя в игре».

Создайте Основные Компоненты и Страницы:

· Home - Главная страница с приветствием и ссылкой на форму.

· FormStep1 - Первый шаг формы. Ввод личных данных (имя, возраст).

· FormStep2 - Второй шаг формы. Выбор игрового аватара.

· FormStep3 - Третий шаг формы. Выбор настроек и предпочтений.

· Summary - Итоговая страница с проверкой данных и подтверждением.

Используйте React Router для маршрутизации между страницами формы и страницей с итогами

 */

function RegistrationForm() {
  cont[(userName, setUserName)] = useState("");
  const [age, setAge] = useState("");
  const [avatar, setAvatar] = useState("");
  const [preferences, setPreferences] = useState({});

  

}
